{
  "steps": [
    {
      "content": "The main part of the page comprises the list of dataflows which you have access to",
      "target": ".dataflowList-help-step"
    },
    {
      "content": "A dataflow is colour coded according to the current status – grey in design and purple when reporting is open. On the dataflow card, you can see various metadata – Your role; Delivery date; Dataflow name; Dataflow description; Associated obligation and instrument; Status",
      "target": ".dataflowList-first-dataflow-help-step"
    },
    {
      "content": "Filters and sort on the various metadata of the dataflows list allow you to find things easily in the dataflows list",
      "target": ".dataflowList-filters-help-step"
    },
    {
      "content": "This button will expand the menu, to show the icon labels",
      "target": ".dataflowList-left-side-bar-expand-help-step"
    },
    {
      "content": "The static menu is available on every page and has four buttons. From top to button, the buttons are:",
      "target": ".dataflowList-left-side-bar-top-section-help-step"
    },
    {
      "content": "1. Dataflows – will return you to this page",
      "target": ".dataflowList-left-side-bar-home-help-step"
    },
    {
      "content": "2. User profile details – allows you to manage some global settings and see your user profile",
      "target": ".dataflowList-left-side-bar-user-profile-help-step"
    },
    {
      "content": "3. Help – Triggers a help walkthrough of the page you are currently on",
      "target": ".dataflowList-left-side-bar-help-help-step"
    },
    {
      "content": "4. Notifications – Provides the history of all notifications (which appear in the top right of the screen) as a list",
      "target": ".dataflowList-left-side-bar-notifications-help-step"
    },
    {
      "content": "5. System notifications – Provides a tool to manage the system notifications",
      "target": ".dataflowList-left-side-bar-system-notifications-help-step"
    },
    {
      "content": "Below the line is the context menu. The context menu changes on each screen. On this screen, you can",
      "target": ".dataflowList-left-side-bar-mid-section-help-step"
    },
    {
      "content": "Create a new dataflow",
      "target": ".dataflowList-left-side-bar-create-dataflow-help-step"
    }
  ]
}
